# Exercises -

### Creating DataFrame

In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'Apples':[30],'Bananas':[21]})

   Apples  Bananas
0      30       21

In [3]:
pd.DataFrame({'Apples':[35,41], 'Bananas':[21,34]}, index=['2017 Sales','2018 Sales'])

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [4]:
pd.DataFrame({'Yes':[50,21],'No':[131,2]})

   Yes   No
0   50  131
1   21    2

In [5]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

### Creating Series

In [6]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
pd.Series([30,5,40],index=['2015 Sales','2016 Sales','2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales     5
2017 Sales    40
Name: Product A, dtype: int64